<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Adobe DNG Converter</string>
    <key>Identifier</key>
    <string>com.github.kfattic.autopkg.download.AdobeDNGConverter</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeDNGConverter</string>
        <key>DOWNLOAD_URL</key>
        <string>https://helpx.adobe.com/camera-raw/using/adobe-dng-converter.html</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>(https://download\.adobe\.com/pub/adobe/dng/mac/DNGConverter_[\d_]+\.dmg)</string>
                <key>result_output_var_name</key>
                <string>dmg_url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%dmg_url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
