<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Adobe DNG Converter and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.kfattic.munki.AdobeDNGConverter</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeDNGConverter</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Adobe</string>
        <key>MUNKI_REPO_PLUGIN</key>
        <string>FileRepo</string>
        <key>MUNKILIB_DIR</key>
        <string>/usr/local/munki</string>
        <key>force_munki_repo_lib</key>
        <false/>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>The Adobe DNG Converter is a free utility that enables you to easily convert camera-specific raw files from more than 600 cameras to the more universal DNG raw format.</string>
            <key>display_name</key>
            <string>Adobe DNG Converter</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>developer</key>
            <string>Adobe</string>
            <key>unattended_install</key>
            <true/>
            <key>version</key>
            <string>17.0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.kfattic.download.AdobeDNGConverter</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
