<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Installs the Xencelabs driver.</string>
    <key>Identifier</key>
    <string>XencelabsDriver</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>drivers/%NAME%</string>
  </dict>
  <key>MinimumVersion</key>
  <string>1.0.0</string>
  <key>ParentRecipe</key>
  <string>XencelabsDriver</string>
  <key>Process</key>
  <array>
    <!-- MunkiPkginfoMerger: merges the pkg info -->
    <dict>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>version</key>
          <string>%version%</string>
        </dict>
      </dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
    </dict>
    <!-- MunkiInstallsItemsCreator: creates the installs item -->
    <dict>
      <key>Arguments</key>
      <dict>
        <key>faux_root</key>
        <string>/Library/Receipts/XencelabsMac_1.3.4-71.pkg</string>
        <key>installs_item_paths</key>
        <array>
          <string>XencelabsDriver.app/Contents/MacOS/Xencelabs</string>
        </array>
      </dict>
      <key>Processor</key>
      <string>MunkiInstallsItemsCreator</string>
    </dict>
    <!-- MunkiPkginfoMerger (second block): merges the pkg info -->
    <dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
    </dict>
    <!-- MunkiImporter: imports the driver -->
    <dict>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%pathname%</string>
        <key>repo_subdirectory</key>
        <string></string>
      </dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
    </dict>
  </array>
</plist>
